tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "withgraphite/tap"
# Platform built on V8 to build network applications
brew "node"
# Terminal multiplexer
brew "tmux"
# UNIX shell (command interpreter)
brew "zsh"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# Typeface made for developers
cask "font-jetbrains-mono"
vscode "akamud.vscode-theme-onedark"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "Catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "GraphQL.vscode-graphql-syntax"
vscode "ms-vscode-remote.remote-containers"
vscode "PKief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "Prisma.prisma"
vscode "wart.ariake-dark"
vscode "YoavBls.pretty-ts-errors"
