tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "libsql/sqld"
tap "withgraphite/tap"
brew "curl"
brew "flyctl"
brew "fzf"
brew "gh"
brew "node"
brew "python@3.12"
brew "jupyterlab"
brew "lazydocker"
brew "lsd"
brew "neovim"
brew "pipx"
brew "ripgrep"
brew "tmux"
brew "zoxide"
brew "zsh"
brew "withgraphite/tap/graphite"
cask "bruno"
cask "font-jetbrains-mono"
vscode "akamud.vscode-theme-onedark"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "graphql.vscode-graphql-syntax"
vscode "ms-vscode-remote.remote-containers"
vscode "patbenatar.advanced-new-file"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "prisma.prisma"
vscode "rjmacarthy.twinny"
vscode "sleistner.vscode-fileutils"
vscode "supermaven.supermaven"
vscode "svelte.svelte-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "wart.ariake-dark"
vscode "yoavbls.pretty-ts-errors"
