tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "libsql/sqld"
tap "tursodatabase/tap"
tap "withgraphite/tap"
brew "flyctl"
brew "gh"
brew "neovim"
brew "node"
brew "python@3.12"
brew "tctl"
brew "tmux"
brew "zsh"
brew "tursodatabase/tap/turso"
brew "withgraphite/tap/graphite"
cask "font-jetbrains-mono"
cask "trunk-io"
cask "warp"

# VScode Extensions (not super needed if you have synced extensions)
vscode "akamud.vscode-theme-onedark"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "graphql.vscode-graphql-syntax"
vscode "ms-vscode-remote.remote-containers"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "prisma.prisma"
vscode "supermaven.supermaven"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "wart.ariake-dark"
vscode "yoavbls.pretty-ts-errors"
